//=============================================================================
//
// タイトル画面の処理 [GAME_tittle.h]
// Author : GP11A132 43 林尚頡
//
//=============================================================================
#pragma once

#include "main.h"




//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGameTitle(void);
void UninitGameTitle(void);
void UpdateGameTitle(void);
void DrawGameTitle(void);
void DrawGameTitle_True(void);

